#!/usr/bin/env python
# coding: utf-8

# In[1]:


# Измерены значения IQ выборки студентов,
# обучающихся в местных технических вузах:
# 131, 125, 115, 122, 131, 115, 107, 99, 125, 111.
# Известно, что в генеральной совокупности IQ распределен нормально.
# Найдите доверительный интервал для математического ожидания с надежностью 0.95.


# In[6]:


import numpy as np
import scipy.stats as stats
iq=np.array([131, 125, 115, 122, 131, 115, 107, 99, 125, 111])
# найдем среднее значение x1 для выборки iq
x1=np.mean(iq)
x1 # x1 = 118.1


# In[4]:


# Найдем несмещенную дисперсию для выборки
d1=np.var(iq,ddof=1)
d1 # d1 = 111.21111111111111


# In[7]:


# Посчитаем критерий Стьюдента (t) и определим интервал
t=stats.t.ppf(0.975,len(iq)-1)
t # t = 2.2621571627409915


# In[12]:


# и определим интервал
x1-t*np.sqrt(d1/10) # нижняя граница 110.556


# In[10]:


x1+t*np.sqrt(d1/10) # верхняя граница 125.644


# In[ ]:


# Ответ: [110.556; 125.644]

